# 1-25까지 list를 만들어 보세요.
#[[1,2,3,4,5][6,7,8,9,10]] 만들어 보세요.
#    [1,2,3,4,5]
#    [6,7,8,9,10]

#1~25번까지의 리스트를 생성
arrs = [i for i in range(1,26)]
# 2 차원 리스트 생성
arrs2 =[[],[],[],[],[]]
#[1,2,3,4,5.......]
# i = 0,1,2,3,4,5,.........
for i,arr in enumerate(arrs):
    
    # arrs2[0].append(1,2,3,4,5)
    # arrs2[1].append(6,7,8,9,10)
    # arrs2[2].append(11,12,13,14,15)    
    # 0,1,2,3,4 -> 0, 5,6,7,8,9 -> 1
    arrs2[i//5].append(arr)
print(arrs2)
print('0,0의 숫자를 가지고 온다',arrs2[0][0])
print('6을 가지고 오려면 1,0의 주소값을 찍어야 한다.', arrs2[1][0])
print('2번째 []을 통째로 가지고 오려면 [1]의 주소 값을 찍어야 한다', arrs2[1])