# print ("hello")
#변수, 함수, 리스트, 클래스

# a = 1 #변수
# a() #함수
# A #첫글자가 대문자일 경우 클래스로 하며, 변경되지 않는 약속형.

from random import *

# print 함수설명 : 화면에 출력이 됩니다. (주석)
print("문자를 출력할 수 있습니다.")
print(100+100)
print(100-50)


print('100', 50)

print((100+5)*2) #사칙연산자의 수학적 순서를 따른다.

print('%d 여기에 들어가 있는 문구는 드래도 출력....%d' % (5,10))

print ('%d*%d=%d' % (1,1,1*1))
print ('%d*%d=%d' % (1,2,1*2))
print ('%d*%d=%d' % (1,3,1*3))
print ('%d*%d=%d' % (1,4,1*4))
print ('%d*%d=%d' % (1,5,1*5))
print ('%d*%d=%d' % (1,6,1*6))

print ('%d %f' % (3.41,3.41))
print ('-'*20)
print ('%07d %f' % (3.41, 3.51))