# print('%.5f' % 3.4121313)

print ('%.2f' % 758.12345678)
print('%010.2f'  % 25.05)
print('%d %f %s' % (150.15,150.15,150.15))
print('*' *10)

print('%10s' % ("python"))

print("{} {} {}" .format(758.12, 50, '문자를 입력함'))


for x in range (1,10):
    for y in range (1,10):
        print(x,'x',y, x*y)
        if (y ==9):
            print("----",x,"-----")
            
            
print('-' *35)

print('데이터'+'100')

print("{0:.1f} {1:} {2:}" .format(758.12, 50, '문자를 입력함'))

print('파이썬 수업을 진행합니다.\n파이썬기본편입니다')
print("파이썬 수업을 진행합니다. 파이썬 기본편입니다.\
수업은 오전 9시30분 부터 오후 6시 20분까지 진행이 됩니다")

print('산에 올라가면 \'야호\'라고한다.')
print("산에 올라가면'야호'라고 합니다.")