#두 수를 입력 받아 사칙 연산이 되도록 프로그램 하세요.
#무한 반복 할 수 있도록 합니다.
#2번까지 실행할 수 있도록 하고, 3번이후에는 지금까지 입력한 값을 출력해 보세요.

사칙연산 = []
사칙연산s = []
a, b = 0, 0
tno = 0

while True:
        if tno <=2:
            a=int(input("첫번째 수를 입력하세요."))
            b=int(input("두번째 수를 입력하세요."))
            더하기 = '{} + {} = {}'.format(a,b,a+b)
            빼기 = '{} - {} = {}' .format(a,b, a-b)
            나누기 = '{} / {} = {}' .format(a,b,a/b)
            곱하기 = '{} * {} = {}'.format(a,b,a*b)
            사칙연산 = [더하기,빼기,나누기,곱하기]
            사칙연산s.append(사칙연산)
            tno +=1
        else:
            break
        
print(사칙연산s)